http/server/latency_all.log
Running Tests: Bare Metal
Concurrency level: 1
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   5375      0 --:--:-- --:--:-- --:--:--  6142
hello:broot:/:hello:bbranch:/:hello:bleaf:/
Summary:
  Total:	10.0016 secs
  Slowest:	0.0027 secs
  Fastest:	0.0005 secs
  Average:	0.0014 secs
  Requests/sec:	739.1797
  
  Total data:	317899 bytes
  Size/request:	43 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [427]	|■■■■
  0.001 [406]	|■■■■
  0.001 [381]	|■■■■
  0.001 [1311]	|■■■■■■■■■■■■■■
  0.002 [3815]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [1045]	|■■■■■■■■■■■
  0.002 [5]	|
  0.002 [0]	|
  0.002 [1]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0009 secs
  25% in 0.0013 secs
  50% in 0.0014 secs
  75% in 0.0015 secs
  90% in 0.0016 secs
  95% in 0.0016 secs
  99% in 0.0017 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0005 secs, 0.0027 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0012 secs, 0.0004 secs, 0.0022 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	7393 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1861      0 --:--:-- --:--:-- --:--:--  1861
hello:broot:/busywork:hello:bbranch:/busywork:hello:bleaf:/busywork
Summary:
  Total:	10.0199 secs
  Slowest:	0.0330 secs
  Fastest:	0.0313 secs
  Average:	0.0320 secs
  Requests/sec:	31.2378
  
  Total data:	20971 bytes
  Size/request:	67 bytes

Response time histogram:
  0.031 [1]	|
  0.032 [8]	|■■
  0.032 [16]	|■■■■
  0.032 [11]	|■■■
  0.032 [80]	|■■■■■■■■■■■■■■■■■■■
  0.032 [171]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [22]	|■■■■■
  0.033 [3]	|■
  0.033 [0]	|
  0.033 [0]	|
  0.033 [1]	|


Latency distribution:
  10% in 0.0318 secs
  25% in 0.0320 secs
  50% in 0.0320 secs
  75% in 0.0321 secs
  90% in 0.0322 secs
  95% in 0.0322 secs
  99% in 0.0324 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0313 secs, 0.0330 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0319 secs, 0.0313 secs, 0.0323 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	313 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2416      0 --:--:-- --:--:-- --:--:--  2416
hello:broot:/prime:hello:bbranch:/prime:hello:bleaf:/prime
Summary:
  Total:	10.0065 secs
  Slowest:	0.0199 secs
  Fastest:	0.0149 secs
  Average:	0.0170 secs
  Requests/sec:	58.9618
  
  Total data:	34220 bytes
  Size/request:	58 bytes

Response time histogram:
  0.015 [1]	|
  0.015 [13]	|■■■■
  0.016 [81]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [99]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [116]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [103]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.018 [79]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.018 [57]	|■■■■■■■■■■■■■■■■■■■■
  0.019 [22]	|■■■■■■■■
  0.019 [12]	|■■■■
  0.020 [7]	|■■


Latency distribution:
  10% in 0.0157 secs
  25% in 0.0163 secs
  50% in 0.0169 secs
  75% in 0.0176 secs
  90% in 0.0182 secs
  95% in 0.0187 secs
  99% in 0.0196 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0149 secs, 0.0199 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0168 secs, 0.0148 secs, 0.0198 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [200]	590 responses



Running Tests: Bare Metal
Concurrency level: 3
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   7166      0 --:--:-- --:--:-- --:--:--  7166
hello:broot:/:hello:bbranch:/:hello:bleaf:/
Summary:
  Total:	10.0012 secs
  Slowest:	0.0029 secs
  Fastest:	0.0005 secs
  Average:	0.0008 secs
  Requests/sec:	3919.2143
  
  Total data:	1685471 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [22050]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [16084]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [1030]	|■■
  0.001 [27]	|
  0.002 [1]	|
  0.002 [1]	|
  0.002 [0]	|
  0.002 [0]	|
  0.003 [0]	|
  0.003 [3]	|


Latency distribution:
  10% in 0.0007 secs
  25% in 0.0007 secs
  50% in 0.0008 secs
  75% in 0.0008 secs
  90% in 0.0009 secs
  95% in 0.0009 secs
  99% in 0.0011 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0005 secs, 0.0029 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0009 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0007 secs, 0.0005 secs, 0.0020 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	39197 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1861      0 --:--:-- --:--:-- --:--:--  1861
hello:broot:/busywork:hello:bbranch:/busywork:hello:bleaf:/busywork
Summary:
  Total:	10.0196 secs
  Slowest:	0.0423 secs
  Fastest:	0.0314 secs
  Average:	0.0320 secs
  Requests/sec:	93.6164
  
  Total data:	62846 bytes
  Size/request:	67 bytes

Response time histogram:
  0.031 [1]	|
  0.032 [922]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.034 [6]	|
  0.035 [2]	|
  0.036 [1]	|
  0.037 [0]	|
  0.038 [2]	|
  0.039 [3]	|
  0.040 [0]	|
  0.041 [0]	|
  0.042 [1]	|


Latency distribution:
  10% in 0.0318 secs
  25% in 0.0319 secs
  50% in 0.0320 secs
  75% in 0.0321 secs
  90% in 0.0322 secs
  95% in 0.0323 secs
  99% in 0.0337 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0314 secs, 0.0423 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0010 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0319 secs, 0.0313 secs, 0.0422 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	938 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2521      0 --:--:-- --:--:-- --:--:--  2521
hello:broot:/prime:hello:bbranch:/prime:hello:bleaf:/prime
Summary:
  Total:	10.0140 secs
  Slowest:	0.0206 secs
  Fastest:	0.0136 secs
  Average:	0.0161 secs
  Requests/sec:	186.1389
  
  Total data:	108112 bytes
  Size/request:	58 bytes

Response time histogram:
  0.014 [1]	|
  0.014 [48]	|■■■■■
  0.015 [324]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [404]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [420]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [280]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.018 [203]	|■■■■■■■■■■■■■■■■■■■
  0.018 [120]	|■■■■■■■■■■■
  0.019 [34]	|■■■
  0.020 [19]	|■■
  0.021 [11]	|■


Latency distribution:
  10% in 0.0147 secs
  25% in 0.0152 secs
  50% in 0.0160 secs
  75% in 0.0169 secs
  90% in 0.0178 secs
  95% in 0.0182 secs
  99% in 0.0195 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0136 secs, 0.0206 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0160 secs, 0.0135 secs, 0.0204 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	1864 responses



Running Tests: Host local containers
Concurrency level: 1
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   4777      0 --:--:-- --:--:-- --:--:--  4777
hello:lroot:/:hello:lbranch:/:hello:lleaf:/
Summary:
  Total:	10.0017 secs
  Slowest:	0.0029 secs
  Fastest:	0.0006 secs
  Average:	0.0015 secs
  Requests/sec:	676.7864
  
  Total data:	291067 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [64]	|■
  0.001 [95]	|■
  0.001 [472]	|■■■■■
  0.002 [3802]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [2326]	|■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [6]	|
  0.002 [2]	|
  0.002 [0]	|
  0.003 [0]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0013 secs
  25% in 0.0014 secs
  50% in 0.0015 secs
  75% in 0.0016 secs
  90% in 0.0016 secs
  95% in 0.0016 secs
  99% in 0.0017 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.0029 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0014 secs, 0.0006 secs, 0.0019 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	6769 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1810      0 --:--:-- --:--:-- --:--:--  1861
hello:lroot:/busywork:hello:lbranch:/busywork:hello:lleaf:/busywork
Summary:
  Total:	10.0063 secs
  Slowest:	0.0331 secs
  Fastest:	0.0318 secs
  Average:	0.0321 secs
  Requests/sec:	31.1804
  
  Total data:	20904 bytes
  Size/request:	67 bytes

Response time histogram:
  0.032 [1]	|
  0.032 [27]	|■■■■■■■■
  0.032 [139]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [121]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [21]	|■■■■■■
  0.032 [1]	|
  0.033 [0]	|
  0.033 [1]	|
  0.033 [0]	|
  0.033 [0]	|
  0.033 [1]	|


Latency distribution:
  10% in 0.0320 secs
  25% in 0.0320 secs
  50% in 0.0321 secs
  75% in 0.0321 secs
  90% in 0.0322 secs
  95% in 0.0322 secs
  99% in 0.0324 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0318 secs, 0.0331 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.0319 secs, 0.0317 secs, 0.0323 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [200]	312 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   1933      0 --:--:-- --:--:-- --:--:--  1933
hello:lroot:/prime:hello:lbranch:/prime:hello:lleaf:/prime
Summary:
  Total:	10.0124 secs
  Slowest:	0.0285 secs
  Fastest:	0.0179 secs
  Average:	0.0229 secs
  Requests/sec:	43.7459
  
  Total data:	25404 bytes
  Size/request:	58 bytes

Response time histogram:
  0.018 [1]	|■
  0.019 [18]	|■■■■■■■■■
  0.020 [21]	|■■■■■■■■■■■
  0.021 [55]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.022 [79]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [66]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.024 [75]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [67]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.026 [33]	|■■■■■■■■■■■■■■■■■
  0.027 [16]	|■■■■■■■■
  0.029 [7]	|■■■■


Latency distribution:
  10% in 0.0201 secs
  25% in 0.0213 secs
  50% in 0.0228 secs
  75% in 0.0245 secs
  90% in 0.0256 secs
  95% in 0.0269 secs
  99% in 0.0282 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0179 secs, 0.0285 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0227 secs, 0.0178 secs, 0.0284 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [200]	438 responses



Running Tests: Host local containers
Concurrency level: 3
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   7166      0 --:--:-- --:--:-- --:--:--  7166
hello:lroot:/:hello:lbranch:/:hello:lleaf:/
Summary:
  Total:	10.0013 secs
  Slowest:	0.0030 secs
  Fastest:	0.0005 secs
  Average:	0.0008 secs
  Requests/sec:	3880.0077
  
  Total data:	1668615 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [22965]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [14910]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [912]	|■■
  0.002 [12]	|
  0.002 [2]	|
  0.002 [0]	|
  0.002 [0]	|
  0.003 [1]	|
  0.003 [0]	|
  0.003 [2]	|


Latency distribution:
  10% in 0.0007 secs
  25% in 0.0007 secs
  50% in 0.0008 secs
  75% in 0.0008 secs
  90% in 0.0009 secs
  95% in 0.0009 secs
  99% in 0.0011 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0005 secs, 0.0030 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0007 secs, 0.0005 secs, 0.0020 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	38805 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1810      0 --:--:-- --:--:-- --:--:--  1810
hello:lroot:/busywork:hello:lbranch:/busywork:hello:lleaf:/busywork
Summary:
  Total:	10.0181 secs
  Slowest:	0.0422 secs
  Fastest:	0.0311 secs
  Average:	0.0320 secs
  Requests/sec:	93.7304
  
  Total data:	62913 bytes
  Size/request:	67 bytes

Response time histogram:
  0.031 [1]	|
  0.032 [905]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.033 [23]	|■
  0.034 [4]	|
  0.036 [1]	|
  0.037 [2]	|
  0.038 [2]	|
  0.039 [0]	|
  0.040 [0]	|
  0.041 [0]	|
  0.042 [1]	|


Latency distribution:
  10% in 0.0318 secs
  25% in 0.0319 secs
  50% in 0.0320 secs
  75% in 0.0320 secs
  90% in 0.0321 secs
  95% in 0.0322 secs
  99% in 0.0336 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0311 secs, 0.0422 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0319 secs, 0.0310 secs, 0.0421 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	939 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2148      0 --:--:-- --:--:-- --:--:--  2148
hello:lroot:/prime:hello:lbranch:/prime:hello:lleaf:/prime
Summary:
  Total:	10.0199 secs
  Slowest:	0.0324 secs
  Fastest:	0.0166 secs
  Average:	0.0231 secs
  Requests/sec:	129.7419
  
  Total data:	75400 bytes
  Size/request:	58 bytes

Response time histogram:
  0.017 [1]	|
  0.018 [45]	|■■■■■■
  0.020 [157]	|■■■■■■■■■■■■■■■■■■■■■
  0.021 [149]	|■■■■■■■■■■■■■■■■■■■■
  0.023 [233]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.024 [241]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.026 [296]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.028 [132]	|■■■■■■■■■■■■■■■■■■
  0.029 [35]	|■■■■■
  0.031 [7]	|■
  0.032 [4]	|■


Latency distribution:
  10% in 0.0189 secs
  25% in 0.0211 secs
  50% in 0.0234 secs
  75% in 0.0253 secs
  90% in 0.0265 secs
  95% in 0.0273 secs
  99% in 0.0290 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0166 secs, 0.0324 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0230 secs, 0.0164 secs, 0.0323 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	1300 responses



Running Tests: Containers
Concurrency level: 1
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   4777      0 --:--:-- --:--:-- --:--:--  4777
hello:croot:/:hello:cbranch:/:hello:cleaf:/
Summary:
  Total:	10.0008 secs
  Slowest:	0.0032 secs
  Fastest:	0.0008 secs
  Average:	0.0016 secs
  Requests/sec:	610.0498
  
  Total data:	262343 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [31]	|
  0.001 [94]	|■
  0.001 [795]	|■■■■■■■■■
  0.002 [3377]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [1773]	|■■■■■■■■■■■■■■■■■■■■■
  0.002 [27]	|
  0.002 [2]	|
  0.003 [0]	|
  0.003 [0]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0014 secs
  25% in 0.0015 secs
  50% in 0.0017 secs
  75% in 0.0017 secs
  90% in 0.0018 secs
  95% in 0.0019 secs
  99% in 0.0019 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.0032 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0015 secs, 0.0007 secs, 0.0022 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	6101 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1810      0 --:--:-- --:--:-- --:--:--  1810
hello:croot:/busywork:hello:cbranch:/busywork:hello:cleaf:/busywork
Summary:
  Total:	10.0079 secs
  Slowest:	0.0336 secs
  Fastest:	0.0320 secs
  Average:	0.0323 secs
  Requests/sec:	30.9756
  
  Total data:	20770 bytes
  Size/request:	67 bytes

Response time histogram:
  0.032 [1]	|
  0.032 [53]	|■■■■■■■■■■■■■
  0.032 [160]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [87]	|■■■■■■■■■■■■■■■■■■■■■■
  0.033 [6]	|■■
  0.033 [2]	|■
  0.033 [0]	|
  0.033 [0]	|
  0.033 [0]	|
[...]
  0.034 [1]	|


Latency distribution:
  10% in 0.0321 secs
  25% in 0.0322 secs
  50% in 0.0323 secs
  75% in 0.0324 secs
  90% in 0.0324 secs
  95% in 0.0325 secs
  99% in 0.0326 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0320 secs, 0.0336 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0006 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0322 secs, 0.0319 secs, 0.0326 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [200]	310 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   1757      0 --:--:-- --:--:-- --:--:--  1757
hello:croot:/prime:hello:cbranch:/prime:hello:cleaf:/prime
Summary:
  Total:	10.0126 secs
  Slowest:	0.0285 secs
  Fastest:	0.0184 secs
  Average:	0.0230 secs
  Requests/sec:	43.4452
  
  Total data:	25230 bytes
  Size/request:	58 bytes

Response time histogram:
  0.018 [1]	|■
  0.019 [24]	|■■■■■■■■■■■■■
  0.020 [30]	|■■■■■■■■■■■■■■■■
  0.021 [58]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.022 [63]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [68]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.024 [75]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [50]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.026 [43]	|■■■■■■■■■■■■■■■■■■■■■■■
  0.028 [15]	|■■■■■■■■
  0.029 [8]	|■■■■


Latency distribution:
  10% in 0.0202 secs
  25% in 0.0212 secs
  50% in 0.0231 secs
  75% in 0.0246 secs
  90% in 0.0261 secs
  95% in 0.0266 secs
  99% in 0.0281 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0184 secs, 0.0285 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0229 secs, 0.0182 secs, 0.0284 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [200]	435 responses



Running Tests: Containers
Concurrency level: 3
Runlength: 10s
Baseline: Pure HTTP forwarding
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    43  100    43    0     0   6142      0 --:--:-- --:--:-- --:--:--  7166
hello:croot:/:hello:cbranch:/:hello:cleaf:/
Summary:
  Total:	10.0011 secs
  Slowest:	0.0053 secs
  Fastest:	0.0006 secs
  Average:	0.0009 secs
  Requests/sec:	3275.2366
  
  Total data:	1408508 bytes
  Size/request:	43 bytes

Response time histogram:
  0.001 [1]	|
  0.001 [30819]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [1917]	|■■
  0.002 [6]	|
  0.002 [3]	|
  0.003 [2]	|
  0.003 [0]	|
  0.004 [5]	|
  0.004 [0]	|
  0.005 [1]	|
  0.005 [2]	|


Latency distribution:
  10% in 0.0008 secs
  25% in 0.0009 secs
  50% in 0.0009 secs
  75% in 0.0009 secs
  90% in 0.0010 secs
  95% in 0.0011 secs
  99% in 0.0013 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.0053 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0008 secs, 0.0006 secs, 0.0052 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	32756 responses



Baseline: 10ms x 3 Busywork
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    67  100    67    0     0   1810      0 --:--:-- --:--:-- --:--:--  1810
hello:croot:/busywork:hello:cbranch:/busywork:hello:cleaf:/busywork
Summary:
  Total:	10.0208 secs
  Slowest:	0.0447 secs
  Fastest:	0.0316 secs
  Average:	0.0324 secs
  Requests/sec:	92.5077
  
  Total data:	62109 bytes
  Size/request:	67 bytes

Response time histogram:
  0.032 [1]	|
  0.033 [887]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.034 [5]	|
  0.036 [6]	|
  0.037 [15]	|■
  0.038 [5]	|
  0.039 [4]	|
  0.041 [2]	|
  0.042 [0]	|
  0.043 [1]	|
  0.045 [1]	|


Latency distribution:
  10% in 0.0320 secs
  25% in 0.0321 secs
  50% in 0.0322 secs
  75% in 0.0324 secs
  90% in 0.0325 secs
  95% in 0.0328 secs
  99% in 0.0376 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0316 secs, 0.0447 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0323 secs, 0.0315 secs, 0.0446 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	927 responses



Prime computation
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    58  100    58    0     0   2071      0 --:--:-- --:--:-- --:--:--  2071
hello:croot:/prime:hello:cbranch:/prime:hello:cleaf:/prime
Summary:
  Total:	10.0172 secs
  Slowest:	0.0315 secs
  Fastest:	0.0174 secs
  Average:	0.0235 secs
  Requests/sec:	127.2816
  
  Total data:	73950 bytes
  Size/request:	58 bytes

Response time histogram:
  0.017 [1]	|
  0.019 [63]	|■■■■■■■■■
  0.020 [107]	|■■■■■■■■■■■■■■■■
  0.022 [132]	|■■■■■■■■■■■■■■■■■■■
  0.023 [202]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.024 [259]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.026 [276]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.027 [151]	|■■■■■■■■■■■■■■■■■■■■■■
  0.029 [59]	|■■■■■■■■■
  0.030 [21]	|■■■
  0.031 [4]	|■


Latency distribution:
  10% in 0.0197 secs
  25% in 0.0218 secs
  50% in 0.0239 secs
  75% in 0.0254 secs
  90% in 0.0267 secs
  95% in 0.0276 secs
  99% in 0.0295 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0174 secs, 0.0315 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0234 secs, 0.0173 secs, 0.0313 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	1275 responses